/********************************************************************************
* 文件：main.c
* 作者：刘帅
* 日期：2015/07/25
* 描述：工程主函数
********************************************************************************/
#include "STC15xx_config.h"
#include "UART.h"
#include "GPIO.h"
#include "EXTI.H"

//***********************************led**************************************************
sbit	led=P3^0;


void main(){
	
	GPIO_config();
	UART1_config();
	Exti_config();
	EA = 1;
	
	for(;;){
		PrintString1("test....\r\n");
		led=~led;
		delay_ms(500);
		
	}
	
	
}